InformationRegisters/ЗвонкиЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиЛида</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИДСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДВАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиЛида/Ext/ManagerModule.bsl
Процедура ДобавитьЗаписьВЗвонкиЛида(Лид, Дата, ИДЗвонка, ИДВАТС = "", ИДСессииЗвонка="") Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗвонкиЛида.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид); 
	НаборЗаписей.Отбор.Дата.Установить(Дата); 
	НаборЗаписей.Отбор.ИДЗвонка.Установить(ИДЗвонка); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Лид = Лид; 
	НоваяЗапись.Дата = Дата;
	НоваяЗапись.ИДЗвонка = ИДЗвонка;
	НоваяЗапись.ИДСессии = ИДСессииЗвонка; //добавлено для OnlinePBX
	
	НоваяЗапись.ИДВАТС = ИДВАТС;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьЛидВРаботеПоИДЗвонка(ИДЗвонка) Экспорт
	
	СтатусыЛидовВРаботе = Новый СписокЗначений;
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ЗаполнитьДанныеЗамера);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.НазначитьЗамер);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйЗаключитьДоговор);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОтложенныйНазначитьЗамер);
	СтатусыЛидовВРаботе.Добавить(Справочники.СтатусыЛида.ОформитьДоговор);
	
	Результат = Документы.Лид.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗвонкиЛида.Лид КАК Лид
	|ИЗ
	|	РегистрСведений.ЗвонкиЛида КАК ЗвонкиЛида
	|ГДЕ
	|	ЗвонкиЛида.Лид.ТекущийСтатус В(&ТекущийСтатус)
	|	И ЗвонкиЛида.ИДЗвонка ПОДОБНО &ИДЗвонка";
	Запрос.УстановитьПараметр("ИДЗвонка",ИДЗвонка);
	Запрос.УстановитьПараметр("ТекущийСтатус",СтатусыЛидовВРаботе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Лид;
	КонецЦикла;
	
	Если Результат = Документы.Лид.ПустаяСсылка() Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗвонкиЛида.Лид КАК Лид
		|ИЗ
		|	РегистрСведений.ЗвонкиЛида КАК ЗвонкиЛида
		|ГДЕ
		|	ЗвонкиЛида.Лид.ТекущийСтатус В(&ТекущийСтатус)
		|	И ЗвонкиЛида.ИДСессии ПОДОБНО &ИДЗвонка";
		Запрос.УстановитьПараметр("ИДЗвонка",ИДЗвонка);
		Запрос.УстановитьПараметр("ТекущийСтатус",СтатусыЛидовВРаботе);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат = Выборка.Лид;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
